{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/javascript": "\n    if (typeof IPython !== \"undefined\") {\n        IPython.CodeCell.options_default.highlight_modes['application/sparql-query'] = {'reg':[/^%%rdf sparql/]};\n        IPython.CodeCell.options_default.highlight_modes['text/turtle'] = {'reg':[/^%%rdf turtle/, /^%%rdf shex/]};\n        IPython.CodeCell.options_default.highlight_modes['application/ld+json'] = {'reg':[/^%%rdf json-ld/]};\n        IPython.notebook.get_cells().map(function(cell){ if (cell.cell_type == 'code'){ cell.auto_highlight(); } });\n    }\n    "
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%reload_ext jupyter-rdfify"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# This cell defines some helpers, imports and strings for tests. Run it!\n",
    "from rdflib import Variable, URIRef, Literal, XSD\n",
    "s = \"http://example.org/subjects#{}\"\n",
    "p = \"http://example.org/properties#{}\"\n",
    "c = \"http://example.org/classes#{}\"\n",
    "lab = \"http://www.w3.org/2000/01/rdf-schema#label\"\n",
    "err = \"Your query gave no result.\"\n",
    "ex = \"http://example.org/{}\"\n",
    "\n",
    "def project(bindings, variables):\n",
    "    result = list()\n",
    "    for binding in bindings:\n",
    "        result.append(binding.project(variables))\n",
    "    return result\n",
    "\n",
    "def bindingToString(binding):\n",
    "    res = \"\"\n",
    "    for var in binding:\n",
    "        res += f\"{var.n3()} -> {binding[var].n3()}\\n\"\n",
    "    return res\n",
    "\n",
    "def lenCheck(bindings, length, msg=None):\n",
    "    assert len(bindings) == length, \\\n",
    "        f\"Your query returned the wrong number of results. It returned {len(bindings)} but should have returned {length}.\\n\" \\\n",
    "        + (msg if msg is not None else \"\")\n",
    "    \n",
    "def exCheck(bindings, binding):\n",
    "    assert binding in bindings, \\\n",
    "        f\"Your result is missing the following binding:\\n{bindingToString(binding)}\"\n",
    "    \n",
    "def bindCheck(bindings, pos, binding):\n",
    "    assert(bindings[pos] == binding), \\\n",
    "        f\"\"\"The result of your query has the wrong binding in position {pos}.\n",
    "            Expected binding:\\n{bindingToString(binding)}\n",
    "            Your binding:\\n{bindingToString(bindings[pos])}\"\"\"\n",
    "    \n",
    "def uri(prefix, name):\n",
    "    return URIRef(prefix.format(name))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/svg+xml": [
       "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n",
       "<!DOCTYPE svg PUBLIC \"-//W3C//DTD SVG 1.1//EN\"\n",
       " \"http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd\">\n",
       "<!-- Generated by graphviz version 8.1.0 (0)\n",
       " -->\n",
       "<!-- Pages: 1 -->\n",
       "<svg width=\"1288pt\" height=\"487pt\"\n",
       " viewBox=\"0.00 0.00 1287.50 486.50\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n",
       "<g id=\"graph0\" class=\"graph\" transform=\"scale(1 1) rotate(0) translate(4 482.5)\">\n",
       "<polygon fill=\"white\" stroke=\"none\" points=\"-4,4 -4,-482.5 1283.5,-482.5 1283.5,4 -4,4\"/>\n",
       "<!-- 0 -->\n",
       "<g id=\"node1\" class=\"node\">\n",
       "<title>0</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"99\" cy=\"-18\" rx=\"45.21\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"99\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">c:Female</text>\n",
       "</g>\n",
       "<!-- 1 -->\n",
       "<g id=\"node2\" class=\"node\">\n",
       "<title>1</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"996\" cy=\"-18\" rx=\"37.02\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"996\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">c:Male</text>\n",
       "</g>\n",
       "<!-- 2 -->\n",
       "<g id=\"node3\" class=\"node\">\n",
       "<title>2</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"1074\" cy=\"-372\" rx=\"35.49\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"1074\" y=\"-366.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Mart</text>\n",
       "</g>\n",
       "<!-- 3 -->\n",
       "<g id=\"node4\" class=\"node\">\n",
       "<title>3</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"705\" cy=\"-106.5\" rx=\"39.07\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"705\" y=\"-101.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Mona</text>\n",
       "</g>\n",
       "<!-- 3&#45;&gt;0 -->\n",
       "<g id=\"edge22\" class=\"edge\">\n",
       "<title>3&#45;&gt;0</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M675.87,-94C669.71,-91.91 663.2,-89.94 657,-88.5 640.66,-84.72 373.69,-55.7 357,-54 266.45,-44.8 242.27,-53.77 153,-36 149.58,-35.32 146.07,-34.5 142.56,-33.59\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"143.69,-30 133.12,-30.67 141.8,-36.74 143.69,-30\"/>\n",
       "<text text-anchor=\"middle\" x=\"529.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 13 -->\n",
       "<g id=\"node14\" class=\"node\">\n",
       "<title>13</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"765,-36 653,-36 653,0 765,0 765,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"709\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Mona Simpson&quot;</text>\n",
       "</g>\n",
       "<!-- 3&#45;&gt;13 -->\n",
       "<g id=\"edge15\" class=\"edge\">\n",
       "<title>3&#45;&gt;13</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M705.79,-88.41C706.33,-76.64 707.07,-60.73 707.7,-47.11\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"711.23,-47.5 708.2,-37.35 704.24,-47.18 711.23,-47.5\"/>\n",
       "<text text-anchor=\"middle\" x=\"732.5\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 14 -->\n",
       "<g id=\"node15\" class=\"node\">\n",
       "<title>14</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"457\" cy=\"-18\" rx=\"86.15\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"457\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">c:FictionalCharacter</text>\n",
       "</g>\n",
       "<!-- 3&#45;&gt;14 -->\n",
       "<g id=\"edge21\" class=\"edge\">\n",
       "<title>3&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M674.8,-94.77C668.9,-92.69 662.76,-90.52 657,-88.5 607.49,-71.13 551.01,-51.52 510.73,-37.57\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"511.93,-33.94 501.33,-33.97 509.64,-40.55 511.93,-33.94\"/>\n",
       "<text text-anchor=\"middle\" x=\"624.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 4 -->\n",
       "<g id=\"node5\" class=\"node\">\n",
       "<title>4</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"592\" cy=\"-195\" rx=\"43.16\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"592\" y=\"-189.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Homer</text>\n",
       "</g>\n",
       "<!-- 4&#45;&gt;1 -->\n",
       "<g id=\"edge12\" class=\"edge\">\n",
       "<title>4&#45;&gt;1</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M635.32,-193.51C700.3,-190.92 824.77,-178.6 913,-124.5 941.94,-106.76 946.48,-97.54 967,-70.5 972.82,-62.83 978.27,-53.86 982.84,-45.58\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"986.35,-47.42 987.94,-36.95 980.17,-44.15 986.35,-47.42\"/>\n",
       "<text text-anchor=\"middle\" x=\"974.38\" y=\"-101.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 4&#45;&gt;3 -->\n",
       "<g id=\"edge13\" class=\"edge\">\n",
       "<title>4&#45;&gt;3</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M614.9,-179.36C624.1,-173.28 634.71,-166.02 644,-159 656.04,-149.91 668.88,-139.23 679.65,-129.96\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"681.54,-132.09 686.8,-122.89 676.95,-126.81 681.54,-132.09\"/>\n",
       "<text text-anchor=\"middle\" x=\"687.12\" y=\"-145.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 6 -->\n",
       "<g id=\"node7\" class=\"node\">\n",
       "<title>6</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"648.38,-124.5 517.62,-124.5 517.62,-88.5 648.38,-88.5 648.38,-124.5\"/>\n",
       "<text text-anchor=\"middle\" x=\"583\" y=\"-101.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Homer J. Simpson&quot;</text>\n",
       "</g>\n",
       "<!-- 4&#45;&gt;6 -->\n",
       "<g id=\"edge3\" class=\"edge\">\n",
       "<title>4&#45;&gt;6</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M590.22,-176.91C589,-165.14 587.34,-149.23 585.92,-135.61\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"589.32,-135.43 584.81,-125.85 582.36,-136.16 589.32,-135.43\"/>\n",
       "<text text-anchor=\"middle\" x=\"614.5\" y=\"-145.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 4&#45;&gt;14 -->\n",
       "<g id=\"edge7\" class=\"edge\">\n",
       "<title>4&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M582.43,-177.05C575.05,-165.54 563.78,-150.93 550,-142.5 517.53,-122.63 491.45,-153.04 466.25,-124.5 447.84,-103.65 447.96,-70.61 451.13,-47.06\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"454.72,-47.79 452.87,-37.36 447.81,-46.67 454.72,-47.79\"/>\n",
       "<text text-anchor=\"middle\" x=\"488.38\" y=\"-101.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 16 -->\n",
       "<g id=\"node17\" class=\"node\">\n",
       "<title>16</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"296\" cy=\"-106.5\" rx=\"41.63\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"296\" y=\"-101.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Marge</text>\n",
       "</g>\n",
       "<!-- 4&#45;&gt;16 -->\n",
       "<g id=\"edge8\" class=\"edge\">\n",
       "<title>4&#45;&gt;16</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M558.88,-183.28C541.67,-177.15 520.56,-168.75 502.75,-159 491.79,-153.01 491.47,-147.45 480,-142.5 437.62,-124.19 385.65,-115.43 347.76,-111.25\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"348.28,-107.68 337.98,-110.14 347.57,-114.65 348.28,-107.68\"/>\n",
       "<text text-anchor=\"middle\" x=\"526.62\" y=\"-145.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:spouse</text>\n",
       "</g>\n",
       "<!-- 17 -->\n",
       "<g id=\"node18\" class=\"node\">\n",
       "<title>17</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"852\" cy=\"-106.5\" rx=\"51.86\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"852\" y=\"-101.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Abraham</text>\n",
       "</g>\n",
       "<!-- 4&#45;&gt;17 -->\n",
       "<g id=\"edge11\" class=\"edge\">\n",
       "<title>4&#45;&gt;17</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M627.68,-184.42C651.89,-177.74 684.54,-168.37 713,-159 745.29,-148.36 781.28,-134.99 808.54,-124.53\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"809.46,-127.54 817.54,-120.68 806.95,-121.01 809.46,-127.54\"/>\n",
       "<text text-anchor=\"middle\" x=\"781.12\" y=\"-145.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 5 -->\n",
       "<g id=\"node6\" class=\"node\">\n",
       "<title>5</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"1110\" cy=\"-106.5\" rx=\"34.97\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"1110\" y=\"-101.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Matt</text>\n",
       "</g>\n",
       "<!-- 5&#45;&gt;1 -->\n",
       "<g id=\"edge38\" class=\"edge\">\n",
       "<title>5&#45;&gt;1</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M1090.86,-91.24C1082.38,-84.91 1072.3,-77.35 1063.25,-70.5 1050.14,-60.57 1035.64,-49.49 1023.48,-40.15\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"1026.15,-37.02 1016.09,-33.71 1021.89,-42.57 1026.15,-37.02\"/>\n",
       "<text text-anchor=\"middle\" x=\"1084.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 10 -->\n",
       "<g id=\"node11\" class=\"node\">\n",
       "<title>10</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"1110\" cy=\"-18\" rx=\"42.65\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"1110\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">c:Person</text>\n",
       "</g>\n",
       "<!-- 5&#45;&gt;10 -->\n",
       "<g id=\"edge23\" class=\"edge\">\n",
       "<title>5&#45;&gt;10</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M1110,-88.41C1110,-76.64 1110,-60.73 1110,-47.11\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"1113.5,-47.35 1110,-37.35 1106.5,-47.35 1113.5,-47.35\"/>\n",
       "<text text-anchor=\"middle\" x=\"1131.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 20 -->\n",
       "<g id=\"node21\" class=\"node\">\n",
       "<title>20</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"1279.5,-36 1170.5,-36 1170.5,0 1279.5,0 1279.5,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"1225\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Matt Groening&quot;</text>\n",
       "</g>\n",
       "<!-- 5&#45;&gt;20 -->\n",
       "<g id=\"edge39\" class=\"edge\">\n",
       "<title>5&#45;&gt;20</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M1129.23,-91.23C1137.75,-84.9 1147.89,-77.34 1157,-70.5 1168.98,-61.5 1182.12,-51.57 1193.62,-42.85\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"1195.21,-45.28 1201.06,-36.45 1190.98,-39.7 1195.21,-45.28\"/>\n",
       "<text text-anchor=\"middle\" x=\"1202.5\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 7 -->\n",
       "<g id=\"node8\" class=\"node\">\n",
       "<title>7</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"1230.5,-390 1127.5,-390 1127.5,-354 1230.5,-354 1230.5,-390\"/>\n",
       "<text text-anchor=\"middle\" x=\"1179\" y=\"-366.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Bart Simpson&quot;</text>\n",
       "</g>\n",
       "<!-- 8 -->\n",
       "<g id=\"node9\" class=\"node\">\n",
       "<title>8</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"914.38,-36 783.62,-36 783.62,0 914.38,0 914.38,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"849\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Abraham Simpson&quot;</text>\n",
       "</g>\n",
       "<!-- 9 -->\n",
       "<g id=\"node10\" class=\"node\">\n",
       "<title>9</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"377\" cy=\"-372\" rx=\"32.93\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"377\" y=\"-366.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Lisa</text>\n",
       "</g>\n",
       "<!-- 9&#45;&gt;0 -->\n",
       "<g id=\"edge36\" class=\"edge\">\n",
       "<title>9&#45;&gt;0</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M343.87,-370.43C251.88,-367.95 0,-354.76 0,-284.5 0,-284.5 0,-284.5 0,-105.5 0,-73.18 30.29,-50.15 57.36,-36.02\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"58.7,-38.77 66.13,-31.21 55.61,-32.49 58.7,-38.77\"/>\n",
       "<text text-anchor=\"middle\" x=\"21.38\" y=\"-189.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 9&#45;&gt;4 -->\n",
       "<g id=\"edge10\" class=\"edge\">\n",
       "<title>9&#45;&gt;4</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M407.72,-365.12C430.48,-359.84 461.64,-350.64 486,-336 534.36,-306.94 547.93,-295.85 577,-247.5 581.35,-240.26 584.51,-231.68 586.76,-223.62\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"590.35,-224.67 589.31,-214.13 583.55,-223.02 590.35,-224.67\"/>\n",
       "<text text-anchor=\"middle\" x=\"588.12\" y=\"-278.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 11 -->\n",
       "<g id=\"node12\" class=\"node\">\n",
       "<title>11</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"447\" cy=\"-283.5\" rx=\"45.72\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"447\" y=\"-278.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Maggie</text>\n",
       "</g>\n",
       "<!-- 9&#45;&gt;11 -->\n",
       "<g id=\"edge19\" class=\"edge\">\n",
       "<title>9&#45;&gt;11</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M399.14,-358.49C408.08,-352.59 417.94,-344.88 425,-336 430.7,-328.83 435.19,-319.97 438.58,-311.62\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"442.14,-313.09 442.3,-302.5 435.57,-310.68 442.14,-313.09\"/>\n",
       "<text text-anchor=\"middle\" x=\"458.62\" y=\"-322.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:sibling</text>\n",
       "</g>\n",
       "<!-- 12 -->\n",
       "<g id=\"node13\" class=\"node\">\n",
       "<title>12</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"713\" cy=\"-460.5\" rx=\"32.93\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"713\" y=\"-455.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">s:Bart</text>\n",
       "</g>\n",
       "<!-- 9&#45;&gt;12 -->\n",
       "<g id=\"edge33\" class=\"edge\">\n",
       "<title>9&#45;&gt;12</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M402.6,-383.62C418.83,-390.43 440.23,-399.54 459,-408 474.59,-415.02 477.42,-419.43 493.75,-424.5 553.14,-442.92 624.75,-452.03 669.59,-456.24\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"669.12,-459.8 679.39,-457.21 669.74,-452.83 669.12,-459.8\"/>\n",
       "<text text-anchor=\"middle\" x=\"517.62\" y=\"-411.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:sibling</text>\n",
       "</g>\n",
       "<!-- 9&#45;&gt;14 -->\n",
       "<g id=\"edge30\" class=\"edge\">\n",
       "<title>9&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M348.3,-362.83C327.94,-356.59 300.2,-347.17 277,-336 195.31,-296.7 112.92,-260.05 149.25,-177 166.3,-138.02 256.88,-70.74 296,-54 320.85,-43.37 349.28,-35.81 375.27,-30.52\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"375.72,-33.8 384.86,-28.45 374.38,-26.93 375.72,-33.8\"/>\n",
       "<text text-anchor=\"middle\" x=\"171.38\" y=\"-189.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 9&#45;&gt;16 -->\n",
       "<g id=\"edge27\" class=\"edge\">\n",
       "<title>9&#45;&gt;16</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M351.34,-360.48C313.3,-343.3 243.36,-305.23 214.75,-247.5 202.47,-222.72 173.2,-215.99 225,-142.5 231.54,-133.22 241.25,-126.29 251.41,-121.15\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"252.5,-124.05 260.19,-116.76 249.64,-117.66 252.5,-124.05\"/>\n",
       "<text text-anchor=\"middle\" x=\"237.12\" y=\"-234.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 19 -->\n",
       "<g id=\"node20\" class=\"node\">\n",
       "<title>19</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"131.5,-301.5 28.5,-301.5 28.5,-265.5 131.5,-265.5 131.5,-301.5\"/>\n",
       "<text text-anchor=\"middle\" x=\"80\" y=\"-278.45\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Lisa Simpson&quot;</text>\n",
       "</g>\n",
       "<!-- 9&#45;&gt;19 -->\n",
       "<g id=\"edge26\" class=\"edge\">\n",
       "<title>9&#45;&gt;19</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M343.6,-371.3C277.19,-371.2 131.76,-367.31 95,-336 88.12,-330.14 84.3,-321.33 82.21,-312.64\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"85.52,-312.2 80.39,-302.93 78.62,-313.37 85.52,-312.2\"/>\n",
       "<text text-anchor=\"middle\" x=\"120.5\" y=\"-322.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;0 -->\n",
       "<g id=\"edge16\" class=\"edge\">\n",
       "<title>11&#45;&gt;0</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M404.48,-276.56C378.71,-271.6 345.91,-262.78 320,-247.5 228.64,-193.62 149.9,-91.86 116.32,-44.47\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"118.82,-42.94 110.22,-36.75 113.08,-46.95 118.82,-42.94\"/>\n",
       "<text text-anchor=\"middle\" x=\"231.38\" y=\"-145.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;4 -->\n",
       "<g id=\"edge20\" class=\"edge\">\n",
       "<title>11&#45;&gt;4</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M473.77,-268.55C485.13,-262.4 498.39,-254.9 510,-247.5 520.53,-240.79 522.31,-237.85 532.75,-231 540.65,-225.82 549.32,-220.5 557.53,-215.62\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"559.03,-218.21 565.89,-210.13 555.49,-212.17 559.03,-218.21\"/>\n",
       "<text text-anchor=\"middle\" x=\"555.12\" y=\"-234.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;9 -->\n",
       "<g id=\"edge4\" class=\"edge\">\n",
       "<title>11&#45;&gt;9</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M410.24,-294.45C397.75,-299.77 385.1,-307.73 377.75,-319.5 373.43,-326.41 372.09,-334.92 372.16,-343.02\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"368.75,-343.29 373.02,-352.98 375.73,-342.74 368.75,-343.29\"/>\n",
       "<text text-anchor=\"middle\" x=\"401.62\" y=\"-322.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:sibling</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;12 -->\n",
       "<g id=\"edge2\" class=\"edge\">\n",
       "<title>11&#45;&gt;12</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M464.9,-300.49C471.54,-306.44 479.13,-313.26 486,-319.5 520.29,-350.64 524.21,-364.3 562.75,-390 598.73,-414 644.33,-433.8 675.81,-446.04\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"674.32,-449.6 684.91,-449.9 676.81,-443.06 674.32,-449.6\"/>\n",
       "<text text-anchor=\"middle\" x=\"586.62\" y=\"-366.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:sibling</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;14 -->\n",
       "<g id=\"edge17\" class=\"edge\">\n",
       "<title>11&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M468.14,-267.43C474.5,-261.87 480.88,-255.06 485,-247.5 500.06,-219.89 511.63,-200.74 491,-177 453.39,-133.72 400.86,-202.28 363.25,-159 354.05,-148.41 341.61,-102.9 380,-54 385.04,-47.58 391.51,-42.31 398.57,-37.97\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"399.64,-40.83 406.75,-32.97 396.29,-34.68 399.64,-40.83\"/>\n",
       "<text text-anchor=\"middle\" x=\"385.38\" y=\"-145.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 15 -->\n",
       "<g id=\"node16\" class=\"node\">\n",
       "<title>15</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"481.88,-213 360.12,-213 360.12,-177 481.88,-177 481.88,-213\"/>\n",
       "<text text-anchor=\"middle\" x=\"421\" y=\"-189.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Maggie Simpson&quot;</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;15 -->\n",
       "<g id=\"edge24\" class=\"edge\">\n",
       "<title>11&#45;&gt;15</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M440.28,-265.54C438.14,-259.85 435.85,-253.44 434,-247.5 431.65,-239.93 429.41,-231.63 427.47,-223.95\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"430.64,-223.18 424.87,-214.3 423.84,-224.84 430.64,-223.18\"/>\n",
       "<text text-anchor=\"middle\" x=\"459.5\" y=\"-234.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;16 -->\n",
       "<g id=\"edge40\" class=\"edge\">\n",
       "<title>11&#45;&gt;16</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M407.37,-274.04C374.72,-264.84 330.13,-246.72 306.75,-213 291.14,-190.48 290.05,-158.48 291.87,-135.64\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"295.43,-136.24 292.98,-125.93 288.47,-135.52 295.43,-136.24\"/>\n",
       "<text text-anchor=\"middle\" x=\"329.12\" y=\"-189.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 12&#45;&gt;1 -->\n",
       "<g id=\"edge31\" class=\"edge\">\n",
       "<title>12&#45;&gt;1</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M745.74,-456.97C823.16,-450.09 1011,-427.75 1011,-373 1011,-373 1011,-373 1011,-105.5 1011,-85.5 1007.06,-63.27 1003.21,-46.35\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"1006.49,-45.99 1000.75,-37.08 999.68,-47.62 1006.49,-45.99\"/>\n",
       "<text text-anchor=\"middle\" x=\"1032.38\" y=\"-234.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 12&#45;&gt;2 -->\n",
       "<g id=\"edge35\" class=\"edge\">\n",
       "<title>12&#45;&gt;2</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M746.08,-458.63C816.06,-456.33 976.61,-448.53 1025,-424.5 1037.31,-418.39 1048.18,-407.84 1056.54,-397.88\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"1059.78,-400.43 1063.21,-390.41 1054.28,-396.1 1059.78,-400.43\"/>\n",
       "<text text-anchor=\"middle\" x=\"1068.12\" y=\"-411.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 12&#45;&gt;4 -->\n",
       "<g id=\"edge34\" class=\"edge\">\n",
       "<title>12&#45;&gt;4</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M713.11,-442.1C712.71,-420.68 710.24,-383.53 699,-354 679.05,-301.58 638.7,-249.4 613.65,-220.06\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"615.91,-218.32 606.71,-213.06 610.62,-222.91 615.91,-218.32\"/>\n",
       "<text text-anchor=\"middle\" x=\"713.12\" y=\"-322.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:parent</text>\n",
       "</g>\n",
       "<!-- 12&#45;&gt;7 -->\n",
       "<g id=\"edge9\" class=\"edge\">\n",
       "<title>12&#45;&gt;7</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M746.1,-458.37C826.42,-455.31 1029.73,-445.67 1094,-424.5 1113,-418.24 1132.22,-407.09 1147.57,-396.76\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"1149.38,-399.07 1155.59,-390.48 1145.38,-393.32 1149.38,-399.07\"/>\n",
       "<text text-anchor=\"middle\" x=\"1153.5\" y=\"-411.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 12&#45;&gt;9 -->\n",
       "<g id=\"edge25\" class=\"edge\">\n",
       "<title>12&#45;&gt;9</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M679.69,-459.08C610.96,-457.66 456.12,-451.48 411.75,-424.5 402.04,-418.59 394.43,-408.82 388.85,-399.37\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"391.54,-397.99 383.75,-390.81 385.37,-401.28 391.54,-397.99\"/>\n",
       "<text text-anchor=\"middle\" x=\"435.62\" y=\"-411.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:sibling</text>\n",
       "</g>\n",
       "<!-- 12&#45;&gt;11 -->\n",
       "<g id=\"edge1\" class=\"edge\">\n",
       "<title>12&#45;&gt;11</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M698.8,-443.82C668.75,-410.95 599.04,-336.5 569,-319.5 547.66,-307.42 521.81,-299.23 499.42,-293.83\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"500.26,-290.21 489.74,-291.4 498.71,-297.03 500.26,-290.21\"/>\n",
       "<text text-anchor=\"middle\" x=\"671.62\" y=\"-366.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:sibling</text>\n",
       "</g>\n",
       "<!-- 12&#45;&gt;14 -->\n",
       "<g id=\"edge28\" class=\"edge\">\n",
       "<title>12&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M731.02,-444.99C748.37,-429.27 772,-402.45 772,-373 772,-373 772,-373 772,-149.75 772,-121.25 772.93,-108.88 753,-88.5 750.89,-86.34 652.92,-54.75 650,-54 613.23,-44.56 571.89,-36.71 536.93,-30.85\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"537.74,-27.27 527.3,-29.09 536.6,-34.17 537.74,-27.27\"/>\n",
       "<text text-anchor=\"middle\" x=\"793.38\" y=\"-234.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 16&#45;&gt;0 -->\n",
       "<g id=\"edge29\" class=\"edge\">\n",
       "<title>16&#45;&gt;0</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M259.62,-97.21C236.34,-91.25 205.83,-82.21 180.25,-70.5 162.27,-62.27 143.54,-50.63 128.6,-40.5\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"131.04,-37.25 120.82,-34.43 127.06,-43 131.04,-37.25\"/>\n",
       "<text text-anchor=\"middle\" x=\"202.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 16&#45;&gt;4 -->\n",
       "<g id=\"edge18\" class=\"edge\">\n",
       "<title>16&#45;&gt;4</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M333.54,-114.79C356.58,-120.28 386.15,-129.16 410,-142.5 419.69,-147.92 418.84,-154.01 428.75,-159 448.2,-168.79 501.04,-179.14 541.38,-186.03\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"540.69,-189.63 551.13,-187.83 541.84,-182.72 540.69,-189.63\"/>\n",
       "<text text-anchor=\"middle\" x=\"452.62\" y=\"-145.7\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">p:spouse</text>\n",
       "</g>\n",
       "<!-- 16&#45;&gt;14 -->\n",
       "<g id=\"edge32\" class=\"edge\">\n",
       "<title>16&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M296.05,-88.45C297.02,-77.19 300.16,-62.92 309.25,-54 319.39,-44.05 347.18,-36.28 375.95,-30.61\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"376.39,-33.9 385.57,-28.62 375.1,-27.02 376.39,-33.9\"/>\n",
       "<text text-anchor=\"middle\" x=\"331.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 18 -->\n",
       "<g id=\"node19\" class=\"node\">\n",
       "<title>18</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"277.88,-36 162.12,-36 162.12,0 277.88,0 277.88,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"220\" y=\"-12.95\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">&quot;Marge Simpson&quot;</text>\n",
       "</g>\n",
       "<!-- 16&#45;&gt;18 -->\n",
       "<g id=\"edge6\" class=\"edge\">\n",
       "<title>16&#45;&gt;18</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M265.64,-93.85C254.61,-88.27 242.93,-80.58 235,-70.5 229.7,-63.76 226.27,-55.2 224.05,-47\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"227.26,-46.29 221.72,-37.26 220.42,-47.77 227.26,-46.29\"/>\n",
       "<text text-anchor=\"middle\" x=\"260.5\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 17&#45;&gt;1 -->\n",
       "<g id=\"edge14\" class=\"edge\">\n",
       "<title>17&#45;&gt;1</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M873.8,-89.93C894.83,-74.92 923.58,-54.4 924.25,-54 935.4,-47.37 947.98,-40.91 959.47,-35.38\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"960.66,-38.22 968.21,-30.78 957.67,-31.89 960.66,-38.22\"/>\n",
       "<text text-anchor=\"middle\" x=\"945.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "<!-- 17&#45;&gt;8 -->\n",
       "<g id=\"edge37\" class=\"edge\">\n",
       "<title>17&#45;&gt;8</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M850.87,-88.06C850.55,-82.45 850.22,-76.22 850,-70.5 849.71,-62.9 849.5,-54.68 849.35,-47.07\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"852.84,-47.11 849.17,-37.17 845.84,-47.23 852.84,-47.11\"/>\n",
       "<text text-anchor=\"middle\" x=\"875.5\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdfs:label</text>\n",
       "</g>\n",
       "<!-- 17&#45;&gt;14 -->\n",
       "<g id=\"edge5\" class=\"edge\">\n",
       "<title>17&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M830.36,-89.94C812.61,-78.02 786.37,-62.26 761,-54 740.85,-47.44 627.68,-35.46 545.31,-27.36\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"545.7,-23.79 535.41,-26.3 545.02,-30.75 545.7,-23.79\"/>\n",
       "<text text-anchor=\"middle\" x=\"818.38\" y=\"-57.2\" font-family=\"Times New Roman,serif\" font-size=\"14.00\">rdf:type</text>\n",
       "</g>\n",
       "</g>\n",
       "</svg>\n"
      ],
      "text/plain": [
       "<graphviz.graphs.Digraph at 0x2603fb58950>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf turtle -l Simpsons\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX s: <http://example.org/subjects#>\n",
    "PREFIX p: <http://example.org/properties#>\n",
    "PREFIX c: <http://example.org/classes#>\n",
    "\n",
    "s:Homer a c:FictionalCharacter, c:Male ;\n",
    "\tp:spouse s:Marge ;\n",
    "\tp:parent s:Abraham ;\n",
    "\tp:parent s:Mona ;\n",
    "\trdfs:label \"Homer J. Simpson\" .\n",
    "s:Marge a c:FictionalCharacter, c:Female ;\n",
    "\tp:spouse s:Homer ;\n",
    "\trdfs:label \"Marge Simpson\" .\n",
    "s:Bart a c:FictionalCharacter, c:Male ;\n",
    "    p:parent s:Homer ;\n",
    "\tp:parent s:Mart ;\n",
    "\tp:sibling s:Lisa ;\n",
    "\tp:sibling s:Maggie ;\n",
    "\trdfs:label \"Bart Simpson\" .\n",
    "s:Lisa a c:FictionalCharacter, c:Female ;\n",
    "    p:parent s:Homer ;\n",
    "    p:parent s:Marge ;\n",
    "    p:sibling s:Bart ;\n",
    "    p:sibling s:Maggie ;\n",
    "    rdfs:label \"Lisa Simpson\" .\n",
    "s:Maggie a c:FictionalCharacter, c:Female ;\n",
    "    p:parent s:Homer ;\n",
    "    p:parent s:Marge ;\n",
    "    p:sibling s:Bart ;\n",
    "    p:sibling s:Lisa ;\n",
    "    rdfs:label \"Maggie Simpson\" .\n",
    "s:Mona a c:FictionalCharacter, c:Female ;\n",
    "    rdfs:label \"Mona Simpson\" .\n",
    "s:Abraham a c:FictionalCharacter, c:Male ;\n",
    "    rdfs:label \"Abraham Simpson\" .\n",
    "s:Matt a c:Person, c:Male ;\n",
    "    rdfs:label \"Matt Groening\" ."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SPARQL: Stored prefix.\n"
     ]
    }
   ],
   "source": [
    "%%rdf sparql --prefix\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX s: <http://example.org/subjects#>\n",
    "PREFIX p: <http://example.org/properties#>\n",
    "PREFIX c: <http://example.org/classes#>\n",
    "PREFIX ex: <http://example.org/> "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.Who are Homer Simpson's parents?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?result</th></tr><tr><td>http://example.org/subjects#Abraham</td></tr><tr><td>http://example.org/subjects#Mona</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s example\n",
    "\n",
    "select ?result\n",
    "where{\n",
    "    s:Homer p:parent ?result\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Homer Simpson's Full Name?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?result</th></tr><tr><td>Homer J. Simpson</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s parentsName\n",
    "SELECT ?result \n",
    "where{\n",
    "    s:Homer rdfs:label ?result\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "3. Who are Marge Simpson's children?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?child</th></tr><tr><td>http://example.org/subjects#Bart</td></tr><tr><td>http://example.org/subjects#Lisa</td></tr><tr><td>http://example.org/subjects#Maggie</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s MargeSimpsonsChildren\n",
    "select ?child \n",
    "where {\n",
    "    ?child p:parent s:Marge  \n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "4. Who are male characters/persons?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?male</th></tr><tr><td>http://example.org/subjects#Homer</td></tr><tr><td>http://example.org/subjects#Bart</td></tr><tr><td>http://example.org/subjects#Abraham</td></tr><tr><td>http://example.org/subjects#Matt</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s Male \n",
    "select ?male \n",
    "where {\n",
    "    ?male a c:Male \n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "5. What is the relation between Marge and Homer?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?relation</th></tr><tr><td>http://example.org/properties#spouse</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s relation\n",
    "select ?relation\n",
    "where{\n",
    "    s:Marge ?relation s:Homer\n",
    "} "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "6.What are all the unique types of relationships (predicates) used in the dataset?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?dRelation</th></tr><tr><td>http://example.org/properties#sibling</td></tr><tr><td>http://www.w3.org/2000/01/rdf-schema#label</td></tr><tr><td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td></tr><tr><td>http://example.org/properties#spouse</td></tr><tr><td>http://example.org/properties#parent</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s distinctRelation\n",
    "select distinct ?dRelation\n",
    "where{\n",
    "    ?subject ?dRelation ?object .\n",
    "}\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "7. Count the number of male and female characters in the dataset."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?maleCount</th><th>?femaleCount</th></tr><tr><td>4</td><td>4</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s countMalefemalecharacter\n",
    "SELECT (COUNT(?male) AS ?maleCount) (COUNT(?female) AS ?femaleCount)\n",
    "WHERE {\n",
    "    { ?male a c:Male . }\n",
    "    UNION\n",
    "    { ?female a c:Female . }\n",
    "}\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "8. Which characters or entities do not have an rdfs:label?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?entity</th></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s noLabelEntities\n",
    "SELECT DISTINCT ?entity\n",
    "WHERE {\n",
    "    ?entity a ?type .\n",
    "    FILTER NOT EXISTS { ?entity rdfs:label ?label . }\n",
    "}\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "9. Which characters or entities do have an rdfs:label?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?entity</th></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql -l simpsons -s noLabelEntities\n",
    "SELECT DISTINCT ?entity\n",
    "WHERE {\n",
    "    ?entity a ?type .\n",
    "    FILTER NOT EXISTS { ?entity rdfs:label ?label . }\n",
    "}"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
